## [liquibase-docs-prod](https://liquibase.app.spacelift.io/stack/liquibase-docs-prod/run/01J4MVRX78CF4C1M33E8Q849B1) plan logs

<details>
<summary>Click here to expand</summary>

```
...
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/changeset-context-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-context-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/changeset-context-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/changeset-label-check.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/changeset-label-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/changeset-label-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/changeset-label-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/constraint-must-exist.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/constraint-must-exist.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/database-checks/constraint-must-exist.html" -> "/liquibase-pro/quality-checks/checks/database-checks/constraint-must-exist.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/check-tables-for-index.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/database-checks/check-tables-for-index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/checks/database-checks/check-tables-for-index.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/constraint-must-exist.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/database-checks/constraint-must-exist.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/checks/database-checks/constraint-must-exist.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/database-checks/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/checks/database-checks/quality-checks-databases.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/object-name-must-match.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/database-checks/object-name-must-match.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/object-name-must-match.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/object-name-must-match.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/object-name-must-not-match.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/database-checks/object-name-must-not-match.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/quality-checks-databases.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/database-checks/quality-checks-databases.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/database-checks/home.html" -> "/liquibase-pro/quality-checks/checks/database-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/git-bash-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/git-bash-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/git-bash-quality-checks.html" -> "/liquibase-pro/quality-checks/workflows/git-bash.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/checks/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/checks/home.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/lab-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/lab-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/modify-data-type-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/modify-data-type-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/modify-data-type-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/modify-data-type-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-match.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/object-name-must-match.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/object-name-must-match.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/object-name-must-match.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/object-name-must-not-match.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/oracle-reserved-keywords.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/oracle-reserved-keywords.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/oracle-reserved-keywords.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/oracle-reserved-keywords.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/postgres-non-reserved-keywords.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/postgres-non-reserved-keywords.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/postgres-non-reserved-keywords.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/postgres-non-reserved-keywords.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/postgres-reserved-keywords.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/postgres-reserved-keywords.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/postgres-reserved-keywords.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/postgres-reserved-keywords.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/primary-key-on-create-table.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/primary-key-on-create-table.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/primary-key-on-create-table.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/primary-key-on-create-table.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/pro-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/pro-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/quality-checks-databases.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/database-checks/home.html" -> "/liquibase-pro/quality-checks/checks/database-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-list.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/quality-checks-list.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/require-chaneset-dis-uuid.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/require-chaneset-dis-uuid.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/require-changeset-dis-uuid.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/require-changeset-dis-uuid.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/rollback-required.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/rollback-required.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/rollback-required.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/rollback-required.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-admin-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-grant-admin-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-admin-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-grant-admin-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-option-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-grant-option-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-option-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-grant-option-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-grant-specific-privs-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-specific-privs-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-grant-specific-privs-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-grant-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-grant-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-grant-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-revoke-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-revoke-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-revoke-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-revoke-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-select-star-warn.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-select-star-warn.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-select-star-warn.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-select-star-warn.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-server-future-reserved-keywords.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/sql-server-future-reserved-keywords.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/sql-server-future-reserved-keywords.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-odbc-reserved-keywords.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-server-odbc-reserved-keywords.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/sql-server-odbc-reserved-keywords.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/sql-server-odbc-reserved-keywords.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-server-reserved-keywords.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-server-reserved-keywords.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/sql-user-defined-pattern-check.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/sql-user-defined-pattern-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/sql-user-defined-pattern-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/sql-user-defined-pattern-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/table-column-limit.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/table-column-limit.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/table-column-limit.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/table-column-limit.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-check.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/table-comment-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/table-comment-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/table-comment-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-pattern-check.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/table-comment-pattern-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/table-comment-pattern-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/table-comment-pattern-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/checks/warn-on-use-database.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/checks/warn-on-use-database.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-checks/warn-on-use-database.html" -> "/liquibase-pro/quality-checks/checks/changelog-checks/warn-on-use-database.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/command-arguments/checks-scope.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/command-arguments/checks-scope.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/command-parameters/checks-scope.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/command-arguments/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/command-arguments/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/command-parameters/home.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/command-arguments/property-substitution-enabled.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/command-arguments/property-substitution-enabled.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/quality-checks/command-parameters/property-substitution-enabled.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/concepts/getting-started-with-the-checks-command.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/concepts/getting-started-with-the-checks-command.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/home.html" -> "/liquibase-pro/quality-checks/workflows/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/concepts/json-object.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/concepts/json-object.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/json-object.html" -> "/liquibase-pro/quality-checks/workflows/json-object.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/concepts/multiple-objects.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/concepts/multiple-objects.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/multiple-objects.html" -> "/liquibase-pro/quality-checks/workflows/multiple-objects.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/concepts/using-quality-checks-in-automation-severity-and-exit-code.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/concepts/using-quality-checks-in-automation-severity-and-exit-code.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-quality-checks-auto-severity-exit-code.html" -> "/liquibase-pro/quality-checks/workflows/automation-severity-exit-code"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-checks-settings-config-file.html" -> "/liquibase-pro/quality-checks/workflows/checks-settings-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/concepts/working-with-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/concepts/working-with-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/home.html" -> "/liquibase-pro/quality-checks/workflows/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/configuring-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/configuring-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/constraint-must-exist.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/constraint-must-exist.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/constraint-must-exist.html" -> "/liquibase-pro/quality-checks/checks/constraint-must-exist.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/custom-policy-checks/api-helper-scripts.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/custom-policy-checks/api-helper-scripts.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/custom-policy-checks/api-helper-scripts.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/custom-policy-checks/checks-python-package.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/custom-policy-checks/checks-python-package.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/custom-policy-checks/checks-python-package.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/custom-policy-checks/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/custom-policy-checks/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/custom-policy-checks/home.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/custom-policy-checks/status-message-variable.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/custom-policy-checks/status-message-variable.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/custom-policy-checks/status-message-variable.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/getting-started-with-the-checks-command.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/getting-started-with-the-checks-command.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/home.html" -> "/liquibase-pro/quality-checks/workflows/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/home.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/json-object.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/json-object.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/json-object.html" -> "/liquibase-pro/quality-checks/workflows/json-object.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/lab-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/lab-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/multiple-objects.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/multiple-objects.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/multiple-objects.html" -> "/liquibase-pro/quality-checks/workflows/multiple-objects.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/object-name-must-match.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/object-name-must-match.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/object-name-must-match.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/object-name-must-match.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/object-name-must-not-match.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/object-name-must-not-match.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/parameters/checks-scope.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/parameters/checks-scope.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/command-arguments/checks-scope.html" -> "/commands/quality-checks/command-parameters/checks-scope.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/quality-checks-json-object.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/quality-checks-json-object.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/json-object.html" -> "/liquibase-pro/quality-checks/workflows/json-object.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/quality-checks-list.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/quality-checks-list.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/table-column-limit.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/table-column-limit.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/table-column-limit.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/table-column-limit.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/table-comment-check.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/table-comment-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/table-comment-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/table-comment-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/table-comment-pattern-check.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/table-comment-pattern-check.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/changelog-database-checks/table-comment-pattern-check.html" -> "/liquibase-pro/quality-checks/checks/changelog-database-checks/table-comment-pattern-check.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/using-quality-checks-in-automation-severity-and-exit-code.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-quality-checks-auto-severity-exit-code.html" -> "/liquibase-pro/quality-checks/workflows/automation-severity-exit-code"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/using-the-checks-settings-configuration-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/using-the-checks-settings-configuration-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-checks-settings-config-file.html" -> "/liquibase-pro/quality-checks/workflows/checks-settings-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/getting-started-with-the-checks-command.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/workflows/getting-started-with-the-checks-command.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/home.html" -> "/liquibase-pro/quality-checks/workflows/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/git-bash-quality-checks.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/workflows/git-bash-quality-checks.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/workflows/git-bash.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/workflows/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/workflows/home.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/json-object.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/workflows/json-object.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/workflows/json-object.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/multiple-objects.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/workflows/multiple-objects.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/workflows/multiple-objects.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/use-checks-settings-config-file.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/workflows/use-checks-settings-config-file.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/workflows/checks-settings-file.html"
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/use-quality-checks-auto-severity-exit-code.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/quality-checks/workflows/use-quality-checks-auto-severity-exit-code.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/liquibase-pro/quality-checks/workflows/automation-severity-exit-code"
    }

  # aws_s3_object.redirects["/commands/quality-checks/workflows/using-the-checks-settings-configuration-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/workflows/using-the-checks-settings-configuration-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-checks-settings-config-file.html" -> "/liquibase-pro/quality-checks/workflows/checks-settings-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/quality-checks/working-with-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/quality-checks/working-with-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/home.html" -> "/liquibase-pro/quality-checks/workflows/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/advanced/configuring-quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/advanced/configuring-quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/checks/home.html" -> "/liquibase-pro/quality-checks/checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/advanced/getting-started-with-the-checks-command.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/advanced/getting-started-with-the-checks-command.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/home.html" -> "/liquibase-pro/quality-checks/workflows/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/advanced/quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/advanced/quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/home.html" -> "/liquibase-pro/quality-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/advanced/using-quality-checks-in-automation-severity-and-exit-code.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/advanced/using-quality-checks-in-automation-severity-and-exit-code.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-quality-checks-auto-severity-exit-code.html" -> "/liquibase-pro/quality-checks/workflows/automation-severity-exit-code"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/concepts/advanced/using-the-checks-settings-configuration-file.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/concepts/advanced/using-the-checks-settings-configuration-file.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/use-checks-settings-config-file.html" -> "/liquibase-pro/quality-checks/workflows/checks-settings-file.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/custom-policy-checks"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/custom-policy-checks"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/custom-policy-checks/home.html" -> "/liquibase-pro/quality-checks/custom-policy-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/custom-policy-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/custom-policy-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/custom-policy-checks/home.html" -> "/liquibase-pro/quality-checks/custom-policy-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/quality-checks"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/quality-checks"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/home.html" -> "/liquibase-pro/quality-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/quality-checks.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/quality-checks.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/home.html" -> "/liquibase-pro/quality-checks/home.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/workflows/quality-checks/concepts/json-object.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/workflows/quality-checks/concepts/json-object.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/quality-checks/workflows/json-object.html" -> "/liquibase-pro/quality-checks/workflows/json-object.html"
        # (11 unchanged attributes hidden)
    }

Plan: 65 to add, 80 to change, 0 to destroy.

[01J4MQ3968KE6PK6QYDDVGC3VA] Changes are GO
[01J4MQ3968KE6PK6QYDDVGC3VA] Uploading the list of managed resources...
[01J4MQ3968KE6PK6QYDDVGC3VA] Generating Infracost JSON report from plan

[01J4MQ3968KE6PK6QYDDVGC3VA] Infracost report generated successfully
[01J4MQ3968KE6PK6QYDDVGC3VA] Mapping Infracost data to resources
[01J4MQ3968KE6PK6QYDDVGC3VA] Costs mapped successfully
[01J4MQ3968KE6PK6QYDDVGC3VA] Please be aware that the run changes calculation includes output changes.
[01J4MQ3968KE6PK6QYDDVGC3VA] Resource list upload is GO
[01J4MQ3968KE6PK6QYDDVGC3VA] Generating JSON representation of the plan...
[01J4MQ3968KE6PK6QYDDVGC3VA] JSON representation is GO
[01J4MQ3968KE6PK6QYDDVGC3VA] Generating Infracost JSON report from plan

[01J4MQ3968KE6PK6QYDDVGC3VA] Infracost report generated successfully
[01J4MQ3968KE6PK6QYDDVGC3VA] Loading custom plan policy inputs...
[01J4MQ3968KE6PK6QYDDVGC3VA] 0 custom plan policy inputs found
[01J4MQ3968KE6PK6QYDDVGC3VA] No plan policies to evaluate
```

</details>